+TITLE: Config
#+PROPERTY: header-args :tangle ~/.doom.d/config.el

** Delete function under cursor
Deletes function name with its braces () during function call

#+begin_src emacs-lisp

(defun delete-function-under-cursor ()
  "Deletes function name and its brackets"
  (setq character (string (char-after)))
  (let ((i 1))
    (evil-backward-word-begin)
    (kill-word 1)
    (delete-char 1)
    (while (or
            (not (zerop i))
            (equal (+ 1 (point)) (point-at-eol)))
      (setq character (string (char-after)))
      (when (equal "(" character) (setq i (+ i 1)) )
      (when (equal ")" character) (setq i (- i 1)) )
      (evil-forward-char)
      )
    (when (not (equal (+ 1 (point)) (point-at-eol)))
      (evil-backward-char)
      (delete-char 1)
      )
    )
  )

(global-set-key (kbd "C-x C-j") ( lambda () (interactive) (delete-funtion-under-cursor)))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (delete-funtion-under-cursor) |

